# Pandas

In [1]:
import pandas as pd

In [2]:
import numpy as np

## Series 객체

In [9]:
s1 = pd.Series([45, 28, 99, 20], index=['a1', 'b1', 'a2', 'b2'])

In [10]:
type(s1)

pandas.core.series.Series

In [11]:
s1[2]

99

In [12]:
s1

a1    45
b1    28
a2    99
b2    20
dtype: int64

In [19]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(1, 7, 20))

In [20]:
s2

0     6
1     4
2     5
3     1
4     2
5     4
6     6
7     1
8     1
9     2
10    5
11    6
12    5
13    2
14    3
15    5
16    6
17    3
18    5
19    4
dtype: int32

In [22]:
counts = s2.value_counts()

In [23]:
counts

5    5
6    4
1    3
2    3
4    3
3    2
dtype: int64

In [24]:
counts.sort_index() # index 정렬

1    3
2    3
3    2
4    3
5    5
6    4
dtype: int64

In [25]:
counts.sort_values()

3    2
1    3
2    3
4    3
6    4
5    5
dtype: int64

## DataFrame

In [27]:
np.random.seed(100)
scores = pd.DataFrame(np.random.randint(100, size=(5, 2)),
                     columns = ['mid', 'final'], index = [1, 3, 9, 6, 5])

In [28]:
scores

   mid  final
1    8     24
3   67     87
9   79     48
6   10     94
5   52     98

In [29]:
scores.index

Int64Index([1, 3, 9, 6, 5], dtype='int64')

In [30]:
scores.columns

Index(['mid', 'final'], dtype='object')

In [33]:
scores.values

array([[ 8, 24],
       [67, 87],
       [79, 48],
       [10, 94],
       [52, 98]])

In [34]:
type(scores.values)

numpy.ndarray

In [35]:
%ls

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: A839-0D04

 C:\Users\hyunsu\Documents\BigDataAnalysis 디렉터리

2021-10-06  오후 03:13    <DIR>          .
2021-10-06  오후 03:13    <DIR>          ..
2021-10-06  오후 02:33    <DIR>          .ipynb_checkpoints
2021-09-15  오후 03:40             5,758 2021-09-15(주피터 기초 사용법 실습).ipynb
2021-09-22  오후 02:09            34,600 2021-09-21 추석 보강 파이썬 기초.ipynb
2021-09-27  오후 03:33             2,893 2021-09-27 클래스 수업 실습.ipynb
2021-10-05  오후 03:04            39,420 2021-09-29 numpy.ipynb
2021-10-06  오후 03:00             8,720 2021-10-06 Pandas.ipynb
2021-10-06  오후 03:09            23,873 diabetes.csv
2021-10-02  오전 02:19             7,589 HW1_201858036_박현수.ipynb
2021-10-02  오전 12:45            10,421 mystery.py
2021-10-06  오후 03:09            25,585 ThoraricSurgery.csv
2021-10-06  오후 03:09            61,192 titanic.csv
2021-09-21  오후 11:57               308 tsize.py
              11개 파일             220,359 바이트
               3개 디렉터리  169,041,055,744 바이트 남음

In [36]:
df = pd.read_csv('diabetes.csv')

In [37]:
df

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [38]:
df.ndim

2

In [39]:
df.shape

(768, 9)

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 9 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Pregnancies               768 non-null    int64
 1   Glucose                   768 non-null    int64
 2   BloodPressure             768 non-null    int64
 3   SkinThickness             768 non-null    int64
 4   Insulin                   768 non-null    int64
 5   BMI                       768 non-null    float64
 6   DiabetesPedigreeFunction  768 non-null    float64
 7   Age                       768 non-null    int64
 8   Outcome                   768 non-null    int64
dtypes: float64(2), int64(7)
memory usage: 54.1 KB

In [42]:
df.describe() # 반환하는 객체도 DafaFrame

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
count,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000
mean,3.845052,120.894531,69.105469,20.536458,79.799479,31.992578,0.471876,33.240885,0.348958
std,3.369578,31.972618,19.355807,15.952218,115.244002,7.884160,0.331329,11.760232,0.476951
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.078000,21.000000,0.000000
25%,1.000000,99.000000,62.000000,0.000000,0.000000,27.300000,0.243750,24.000000,0.000000
50%,3.000000,117.000000,72.000000,23.000000,30.500000,32.000000,0.372500,29.000000,0.000000
75%,6.000000,140.250000,80.000000,32.000000,127.250000,36.600000,0.626250,41.000000,1.000000
max,17.000000,199.000000,122.000000,99.000000,846.000000,67.100000,2.420000,81.000000,1.000000

In [43]:
df.head(3)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1

In [44]:
df.tail(3)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [46]:
df['Age']

0      50
1      31
2      32
3      21
4      33
       ..
763    63
764    27
765    30
766    47
767    23
Name: Age, Length: 768, dtype: int64

In [47]:
type(df['Age'])

pandas.core.series.Series

In [48]:
df.Age

0      50
1      31
2      32
3      21
4      33
       ..
763    63
764    27
765    30
766    47
767    23
Name: Age, Length: 768, dtype: int64

In [49]:
scores

   mid  final
1    8     24
3   67     87
9   79     48
6   10     94
5   52     98

In [50]:
scores.iloc[0, 0]

8

In [51]:
scores.iloc[1:3, 1:]

   final
3     87
9     48

In [52]:
scores.loc[:, 'mid']

1     8
3    67
9    79
6    10
5    52
Name: mid, dtype: int32

In [53]:
scores.loc[:, 'mid':]

   mid  final
1    8     24
3   67     87
9   79     48
6   10     94
5   52     98

In [55]:
scores.loc[:9, :]

   mid  final
1    8     24
3   67     87
9   79     48

In [56]:
scores

   mid  final
1    8     24
3   67     87
9   79     48
6   10     94
5   52     98

In [57]:
scores[scores.mid > 50]

   mid  final
3   67     87
9   79     48
5   52     98

In [58]:
scores['total'] = scores.mid + scores.final

In [59]:
scores

   mid  final  total
1    8     24     32
3   67     87    154
9   79     48    127
6   10     94    104
5   52     98    150

In [62]:
del scores['total']

In [63]:
scores

   mid  final
1    8     24
3   67     87
9   79     48
6   10     94
5   52     98

In [67]:
new_scores = scores.drop([9, 1])

In [68]:
new_scores

   mid  final
3   67     87
6   10     94
5   52     98

In [76]:
df

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [77]:
df.mean()

Pregnancies                   3.845052
Glucose                     120.894531
BloodPressure                69.105469
SkinThickness                20.536458
Insulin                      79.799479
BMI                          31.992578
DiabetesPedigreeFunction      0.471876
Age                          33.240885
Outcome                       0.348958
dtype: float64

In [78]:
df.groupby('Outcome').mean()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age
Outcome,,,,,,,,
0,3.298000,109.980000,68.184000,19.664000,68.792000,30.304200,0.429734,31.190000
1,4.865672,141.257463,70.824627,22.164179,100.335821,35.142537,0.550500,37.067164

### 누락된 데이터 처리하기

In [2]:
import numpy as np
import pandas as pd

In [3]:
a = np.array([4, 2, np.nan, 5])

In [5]:
a.dtype

dtype('float64')

In [6]:
type(np.nan)

float

In [7]:
np.sum(a)

nan

In [8]:
np.nansum(a)

11.0

In [10]:
df = pd.DataFrame([[1, 2], [3, np.nan]], columns=['x', 'y'])

In [11]:
df

   x    y
0  1  2.0
1  3  NaN

In [12]:
df.isnull()

       x      y
0  False  False
1  False   True

In [14]:
df.notnull()

      x      y
0  True   True
1  True  False

In [16]:
df.dropna() # NaN이 있는 모든 행을 삭제

   x    y
0  1  2.0

In [18]:
df.dropna(axis=1) # NaN이 있는 열을 삭제

   x
0  1
1  3

# 타이타닉 데이터 분석

In [19]:
titanic = pd.read_csv('titanic.csv')

In [20]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [21]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [22]:
titanic.describe() # 수치형 칼럼에 대한 요약 통계량

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [23]:
titanic.Survived.unique()

array([0, 1], dtype=int64)

In [25]:
titanic.Name.unique().shape

(891,)

In [27]:
titanic['Embarked'].unique() # Embarked : 탑승하다. 표에서의 의미는 탑승한 항구를 의미

array(['S', 'C', 'Q', nan], dtype=object)

In [31]:
titanic['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [32]:
titanic.Cabin.isnull().sum() # 합으로 True의 갯수를 셈

687

In [33]:
titanic.dropna().shape

(183, 12)

In [34]:
titanic2 = titanic.drop(['Cabin'], axis=1) # Cabin이라는 이름을 가진 열을 삭제

In [36]:
titanic2.shape

(891, 11)

In [37]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [38]:
titanic3 = titanic.dropna()

In [39]:
titanic3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 183 entries, 1 to 889
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  183 non-null    int64
 1   Survived     183 non-null    int64
 2   Pclass       183 non-null    int64
 3   Name         183 non-null    object
 4   Sex          183 non-null    object
 5   Age          183 non-null    float64
 6   SibSp        183 non-null    int64
 7   Parch        183 non-null    int64
 8   Ticket       183 non-null    object
 9   Fare         183 non-null    float64
 10  Cabin        183 non-null    object
 11  Embarked     183 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 18.6+ KB

# 데이터 결합

In [42]:
df1 = pd.DataFrame({'A':[1, 2, 3], 'B':[4, 5, 6]}) # 딕셔너리={키='A' : 밸류=[1, 2, 3]}

In [43]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [44]:
df2 = pd.DataFrame({'A':[10, 20], 'B':[40, 55]}, index=[5, 9])

In [45]:
df2

    A   B
5  10  40
9  20  55

In [47]:
pd.concat([df1, df2])

    A   B
0   1   4
1   2   5
2   3   6
5  10  40
9  20  55

In [49]:
df3 = pd.DataFrame({'C':[5, 2, 8], 'D':[10, 50, -2]})

In [50]:
df3

   C   D
0  5  10
1  2  50
2  8  -2

In [51]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [52]:
pd.concat([df1, df3], axis=1)

   A  B  C   D
0  1  4  5  10
1  2  5  2  50
2  3  6  8  -2

In [53]:
df4 = df3.loc[0:1, :]

In [54]:
df4

   C   D
0  5  10
1  2  50

In [55]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [57]:
pd.concat([df1, df4], axis=1) # 외부조인(합집합)

   A  B    C     D
0  1  4  5.0  10.0
1  2  5  2.0  50.0
2  3  6  NaN   NaN

In [58]:
pd.concat([df1, df4], axis=1, join='inner') # 내부 조인(교집합)

   A  B  C   D
0  1  4  5  10
1  2  5  2  50

In [59]:
dept = pd.DataFrame({'name':['강', '박', '이', '최'], 'dep':['컴공', '컴공', '통계', '소융']})

In [60]:
dept

  name dep
0    강  컴공
1    박  컴공
2    이  통계
3    최  소융

In [61]:
year = pd.DataFrame({'name':['이', '최', '강'], 'yr':[2018, 2016, 2017]})

In [63]:
year

  name    yr
0    이  2018
1    최  2016
2    강  2017

In [65]:
pd.merge(dept, year) # dept에 있었던 '박'이 없어졌기 때문에 inner join인 것을 알 수 있음.

  name dep    yr
0    강  컴공  2017
1    이  통계  2018
2    최  소융  2016

In [66]:
pd.merge(dept, year, on='name')

  name dep    yr
0    강  컴공  2017
1    이  통계  2018
2    최  소융  2016

In [67]:
pd.merge(dept, year, how='outer')

  name dep      yr
0    강  컴공  2017.0
1    박  컴공     NaN
2    이  통계  2018.0
3    최  소융  2016.0

In [68]:
year2 = pd.DataFrame({'student':['이', '최', '강'], 'yr':[2018, 2016, 2017]})

In [71]:
pd.merge(dept, year2, left_on='name', right_on='student')

  name dep student    yr
0    강  컴공       강  2017
1    이  통계       이  2018
2    최  소융       최  2016

In [72]:
pd.merge(dept, year2, left_on='name', right_on='student').drop('student', axis=1)

  name dep    yr
0    강  컴공  2017
1    이  통계  2018
2    최  소융  2016